xmlcf/InformationRegisters/КупоныПоОблигациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КупоныПоОблигациям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВключаетНалог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xmlcf/InformationRegisters/КупоныПоОблигациям/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьКупоныНаСервере()

	ДатаКупона = НачальнаяДатаРасчета;
	
	ОтборыРегистра = Список.Отбор.Элементы;
	
	Актив = Неопределено;
	
	Для каждого ЭлементыОтбора из ОтборыРегистра Цикл 
		Если ЭлементыОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Актив") тогда
			Актив = ЭлементыОтбора.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Актив = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Пока ДатаКупона <= ДатаПогашения Цикл
		НаборЗаписей = РегистрыСведений.КупоныПоОблигациям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ДатаКупона);
		НаборЗаписей.Отбор.Актив.Установить(Актив);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() <> 0 тогда
			ЗаписьНабора = НаборЗаписей[0];
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();
		КонецЕсли;
		ЗаписьНабора.Актив = Актив;
		ЗаписьНабора.Период = ДатаКупона;
		ЗаписьНабора.Номинал = Актив.Номинал;
		ЗаписьНабора.СуммаКупона = СуммаКупонаДляЗаполнения;
		ЗаписьНабора.СуммаВключаетНалог = ?(ДатаКупона > Дата(2021,1,1,0,0,0),Истина, Ложь);
		НаборЗаписей.Записать();
		
		ДатаКупона = ДатаКупона + (86400 * ПериодВыплатыДней);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКупоны(Команда)
	ЗаполнитьКупоныНаСервере();
КонецПроцедуры
